tap "phinze/cask"
tap "homebrew/core"
tap "homebrew/gui"
tap "homebrew/bundle"
tap "homebrew/services"
tap "goles/battery"
tap "caskroom/fonts"
tap "caskroom/cask"
tap "thoughtbot/formulae"
brew "autojump"
brew "ctags"
brew "dash"
brew 'diff-so-fancy'
brew "dnsmasq", restart_service: true
brew "git"
brew "ffmpeg"
brew "graphicsmagick", args: ["with-ghostscript"]
brew "heroku"
brew "highlight"
brew "hiredis"
brew "htop"
brew "hub"
brew "imagemagick@6"
brew "openssl"
brew "libxml2"
brew "sqlite", args: ["with-json1"]
brew "python"
brew "python3"
brew "macvim"
brew "memcached", restart_service: true
brew "neovim"
brew "p7zip"
brew 'postgresql', restart_service: true
brew "pgcli"
brew "poppler"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "spark"
brew "the_silver_searcher"
brew "tmux"
brew "fzf"
brew "tree"
brew "v8@3.15"
brew "vim", args: ["with-override-system-vi"]
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "thoughtbot/formulae/gitsh"
brew "goles/battery/battery"
cask "caskroom/fonts/font-fira-code"
cask "phinze/cask/alfred"
cask "phinze/cask/betterzipql"
cask "phinze/cask/dbeaver-community"
cask "phinze/cask/flux"
cask "phinze/cask/qlcolorcode"
cask "phinze/cask/qlimagesize"
cask "phinze/cask/qlmarkdown"
cask "phinze/cask/qlprettypatch"
cask "phinze/cask/qlstephen"
cask "phinze/cask/quicklook-csv"
cask "phinze/cask/quicklook-json"
cask "phinze/cask/sublime-text"
cask "phinze/cask/suspicious-package"
cask "phinze/cask/time-out"
cask "phinze/cask/vagrant"
cask "phinze/cask/vagrant-manager"
cask "phinze/cask/virtualbox"
cask "phinze/cask/vlc"
cask "phinze/cask/webpquicklook"
cask "phinze/cask/wkhtmltopdf"
