tap "phinze/cask"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/cask"

brew "autojump"
brew "ctags"
brew "dash"
brew "dnsmasq", restart_service: true
brew "ffmpeg"
brew "graphicsmagick", args: ["with-ghostscript"]
brew "heroku"
brew "highlight"
brew "hiredis"
brew "htop"
brew "imagemagick@6"
brew "openssl"
brew "libxml2"
brew "sqlite", args: ["with-json1"]
brew "python"
brew "python3"
brew "memcached", restart_service: true
brew "neovim"
brew "p7zip"
brew "poppler"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "fzf"
brew "vim", args: ["with-override-system-vi"]
brew "yarn"
brew "bat"
brew "ripgrep"
brew "lsd"
brew "macvim"
brew "vifm"
brew "brew-gem"
# Usefull utils
brew "moreutils"

# DB
cask "phinze/cask/dbeaver-community"

# Zsh
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Git client
brew "git"
brew "gh"
brew "hub"

# Casks
cask "phinze/cask/alfred"
cask "phinze/cask/flux"
cask "phinze/cask/sublime-text"
cask "phinze/cask/suspicious-package"
cask "phinze/cask/time-out"
cask "phinze/cask/vlc"
cask "phinze/cask/webpquicklook"
cask "phinze/cask/wkhtmltopdf"
cask "slowquitapps"
cask "dozer"
cask "caskroom/fonts/font-fira-code"
cask font-jetbrains-mono
cask font-jetbrainsmono-nerd-font

# Quicklook plugins https://github.com/sindresorhus/quick-look-plugins
cask "phinze/cask/qlcolorcode"
cask "phinze/cask/qlimagesize"
cask "phinze/cask/qlmarkdown"
cask "phinze/cask/qlprettypatch"
cask "phinze/cask/qlstephen"
cask "phinze/cask/quicklook-csv"
cask "phinze/cask/quicklook-json"
